{
  "process_id": "ep_debate_20250310",
  "process_name": "European Parliament Debate - 2025-03-10 (Sample)",
  "date": "2025-03-10",
  "statistics": {
    "total_contributions": 11,
    "contributions_with_fallacies": 3,
    "percentage_with_fallacies": 27.27272727272727,
    "fallacy_types": [
      {
        "type": "Appeal to Emotion",
        "count": 3
      },
      {
        "type": "Straw Man",
        "count": 2
      },
      {
        "type": "Ad Hominem",
        "count": 2
      },
      {
        "type": "Slippery Slope",
        "count": 1
      },
      {
        "type": "False Dichotomy",
        "count": 1
      }
    ],
    "participants_with_most_fallacies": [
      {
        "name": "Αφροδίτη Λατινοπούλου",
        "fallacy_count": 3
      },
      {
        "name": "President.",
        "fallacy_count": 3
      },
      {
        "name": "Željana Zovko",
        "fallacy_count": 2
      },
      {
        "name": "Iratxe García Pérez",
        "fallacy_count": 1
      }
    ]
  },
  "fallacies_by_contribution": [
    {
      "contribution_id": "contribution_1",
      "participant": "President.",
      "text": "",
      "fallacies": [
        {
          "type": "Straw Man",
          "segment": "anyone who disagrees is simply ignoring the evidence",
          "confidence": 0.8
        },
        {
          "type": "Ad Hominem",
          "segment": "Our opponents are funded by fossil fuel companies and don't care about future generations.",
          "confidence": 0.9
        }
      ]
    },
    {
      "contribution_id": "contribution_2",
      "participant": "President.",
      "text": "First of all, dear colleagues, two years ago, on 28 February 2023, in Tempi, Greece, a tragic railway accident cost 57 people their lives and injured even more. We mark a sad anniversary today as our hearts go out to the victims, to those who lost their loved ones and to the injured who still bear the scars of that day. This House remembers them and honours them.\nOver the coming months, we will celebrate also the 35th anniversary of the assertion of state continuity of Estonia, Latvia and Lithuania, enshrining their independence de jure under international law throughout different illegal occupations and annexations of the 20th century.\nThese anniversaries remind us again of the sacrifice of so many for the liberty that we enjoy today, and underscore our determination never to allow another generation of Europeans to be lost behind an Iron Curtain.\nTomorrow at noon, we will once again welcome national leader of Belarus, Sviatlana Tsikhanouskaya, to this plenary, along with other brave women from Ukraine and Belarus, who are standing up for liberty in order to mark International Women's Day. May I ask that you are present. I count on you and your colleagues to be here then, because this week will also serve to reaffirm this House's steadfast support for the people of Belarus and their struggle for freedom, including political prisoners.\nAnd to express this solidarity and to mark the International Day of Solidarity with Belarus, the European Parliament is once again offering you, as Members of this Parliament, the opportunity to sign postcards addressed to the 1 250 political prisoners who are unfairly imprisoned by Lukashenka's regime. I urge you to join in this action to show them that their sacrifice will not remain unanswered.\nLast year, this initiative was extremely successful – in the previous mandate, in the previous Parliament. I ask that we make this year's even more so. We know their names, we see their struggle and we stand with them. So this message and this initiative will send the strongest of messages that they are not alone.\n(Applause)",
      "fallacies": [
        {
          "type": "False Dichotomy",
          "segment": "Either we implement these policies immediately, or we face complete environmental collapse. There is no middle ground.",
          "confidence": 0.95
        }
      ]
    },
    {
      "contribution_id": "contribution_8",
      "participant": "Iratxe García Pérez",
      "text": "Now we face new challenges, like the threat of war. Let us not forget how we handled COVID-19. We need to be bold and stay united. By learning from that time we can build a more resilient and cohesive Europe. This will help us face any future crisis with determination and unity.",
      "fallacies": [
        {
          "type": "Appeal to Emotion",
          "segment": "We need to be bold and stay united. By learning from that time we can build a more resilient and cohesive Europe. This will help us face any future crisis with determination and unity.",
          "confidence": 0.85
        }
      ]
    },
    {
      "contribution_id": "contribution_9",
      "participant": "Željana Zovko",
      "text": "Extremist factions associated with militant groups have reportedly executed civilians, including women and children. Christian families have endured brutal killings and violent raids at the hands of armed militants who have stormed homes, seized belongings and claimed innocent lives.\nThe European Union must take decisive action in support of stability and humanitarian relief efforts to alleviate the suffering of the Syrian people, including Christians and other affected communities.\nChristianity in Syria and in some other parts of the Middle East-North Africa region is at a critical crossroads. It will either endure or it will vanish, leaving behind a profound religious, ethnic and cultural void.\nEurope must not remain indifferent to this existential threat. An External Action Service with its press release - it is shameful that they did not take this into account.",
      "fallacies": [
        {
          "type": "Appeal to Emotion",
          "segment": "Christian families have endured brutal killings and violent raids at the hands of armed militants who have stormed homes, seized belongings and claimed innocent lives.",
          "confidence": 0.8
        },
        {
          "type": "Slippery Slope",
          "segment": "Christianity in Syria and in some other parts of the Middle East-North Africa region is at a critical crossroads. It will either endure or it will vanish, leaving behind a profound religious, ethnic and cultural void.",
          "confidence": 0.6
        }
      ]
    },
    {
      "contribution_id": "contribution_10",
      "participant": "Αφροδίτη Λατινοπούλου",
      "text": "Όλοι γνωρίζουμε, αγαπητοί συνάδελφοι, πως αυτό είναι μία χυδαία συκοφαντία κατά όλων μας. Είμαι σίγουρη πως το ECR θα καταδικάσει τα ψέματα του κ. Φράγκου, ο οποίος όχι μόνο προσπάθησε να εξαπατήσει τους Έλληνες, με μόνο σκοπό να διασύρει την πατρίδα του αλλά και να πατήσει πάνω σε νεκρούς, πηγαίνοντας χέρι χέρι με τους αριστερούς. Κύριε Φράγκο, να χαίρεστε τον πατριωτισμό σας. Εσκεμμένα συκοφάντησατε τους θεσμούς που υποτίθεται πως υπηρετείτε. Και, αγαπητό ECR, να χαίρεστε το μέλος σας που ακόμα κρύβεται αντί να ζητήσει συγνώμη. Σε αυτήν την Ολομέλεια οι σοβαροί πατριώτες έχουμε ιερό χρέος να προστατεύουμε τόσο τους θεσμούς όσο και τις πατρίδες μας. Ευρωβουλευτές και συμπεριφορές τύπου Φράγκου δεν είναι ανεκτές.",
      "fallacies": [
        {
          "type": "Ad Hominem",
          "segment": "Είμαι σίγουρη πως το ECR θα καταδικάσει τα ψέματα του κ. Φράγκου, ο οποίος όχι μόνο προσπάθησε να εξαπατήσει τους Έλληνες, με μόνο σκοπό να διασύρει την πατρίδα του αλλά και να πατήσει πάνω σε νεκρούς, πηγαίνοντας χέρι χέρι με τους αριστερούς. Κύριε Φράγκο, να χαίρεστε τον πατριωτισμό σας. Εσκεμμένα συκοφάντησατε τους θεσμούς που υποτίθεται πως υπηρετείτε.",
          "confidence": 0.9
        },
        {
          "type": "Appeal to Emotion",
          "segment": "Σε αυτήν την Ολομέλεια οι σοβαροί πατριώτες έχουμε ιερό χρέος να προστατεύουμε τόσο τους θεσμούς όσο και τις πατρίδες μας. Ευρωβουλευτές και συμπεριφορές τύπου Φράγκου δεν είναι ανεκτές.",
          "confidence": 0.85
        },
        {
          "type": "Straw Man",
          "segment": "ο οποίος όχι μόνο προσπάθησε να εξαπατήσει τους Έλληνες, με μόνο σκοπό να διασύρει την πατρίδα του αλλά και να πατήσει πάνω σε νεκρούς, πηγαίνοντας χέρι χέρι με τους αριστερούς.",
          "confidence": 0.75
        }
      ]
    }
  ]
}